{
  "strict_legal": [
    "You have thirty (30) days from receipt of this dispute to complete your reinvestigation and provide me with written notice of the results, as required by FCRA Section 611(a)(6)(A). Failure to comply with FCRA requirements may result in civil liability under 15 U.S.C. ยง 1681n (willful noncompliance) or 15 U.S.C. ยง 1681o (negligent noncompliance).",
    "This communication shall serve as formal notice of dispute for purposes of triggering your obligations under the Fair Credit Reporting Act. I reserve all rights and remedies available to me under federal law.",
    "I expect full compliance with FCRA requirements within the statutory timeframe. This letter preserves my right to pursue all available legal remedies should you fail to properly investigate and resolve this dispute."
  ],
  "professional": [
    "Please complete your investigation within 30 days as required by the FCRA. I look forward to receiving the results of your investigation in writing. Thank you for your prompt attention to this matter.",
    "I request that you conduct a thorough investigation and provide me with written notice of the results within the timeframe required by law. Please contact me if you need any additional information.",
    "Thank you for taking the time to review this dispute. I expect to receive written results of your investigation within 30 days."
  ],
  "soft_legal": [
    "Thank you for taking the time to review my dispute. I know you handle many requests, and I appreciate your help in getting my credit report corrected. Under the FCRA, you have 30 days to complete your investigation. Please let me know the results in writing.",
    "I appreciate your help with this matter. Please let me know if you need any more information from me. I look forward to hearing from you within 30 days.",
    "Thanks again for looking into this for me. I understand you have 30 days to complete the investigation, and I'm happy to provide any additional information you might need."
  ],
  "aggressive": [
    "YOU HAVE EXACTLY THIRTY (30) DAYS from receipt of this notice to conduct a reasonable reinvestigation and DELETE any information that cannot be INDEPENDENTLY VERIFIED. Failure to comply will be deemed WILLFUL under the FCRA, entitling me to pursue MAXIMUM DAMAGES available under federal law. GOVERN YOURSELF ACCORDINGLY.",
    "This is your FORMAL NOTICE. Continued reporting of unverified, inaccurate information after receipt constitutes WILLFUL NONCOMPLIANCE subject to statutory damages, punitive damages, and attorney's fees. I will not hesitate to pursue all available legal remedies.",
    "Time is of the essence. You have 30 days to comply or face the consequences of your FCRA violations. I am documenting everything and will proceed accordingly."
  ]
}
